// Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22
Console.Clear();
Console.Write("Введите число a: ");
int a = int.Parse(Console.ReadLine());
Console.Write("Введите число b: ");
int b = int.Parse(Console.ReadLine());
Console.Write("Введите число с: ");
int с = int.Parse(Console.ReadLine());
int a,b,c;
if(a > b && a > c){
    ();
}else{
    ($"Большее число {max = b}");
}
if(max > c){
    ($"Большее число {max = a}");
}else{
    ($"Большее число {max = c}");
}
Console.Write($"{max} ");